<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<!--
The MIT License (MIT)

Copyright (c) 2017 Ivor Wanders

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
-->
<dict>
	<key>PayloadContent</key>
	<array>
            <dict>
                <key>IPv4</key>
                <dict>
                        <key>OverridePrimary</key>
                        <integer>0</integer>
                </dict>
                <key>PayloadDescription</key>
                <string>{VPNPayloadDescription:s}</string>
                <key>PayloadDisplayName</key>
                <string>{VPNPayloadDisplayName:s}</string>
                <key>PayloadIdentifier</key>
                <string>{host:s}.vpnondemand</string>
                <key>PayloadOrganization</key>
                <string>{VPNPayloadOrganization:s}</string>
                <key>PayloadType</key>
                <string>com.apple.vpn.managed</string>
                <key>PayloadUUID</key>
                <string>{vpn_payload_uuid:s}</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>Proxies</key>
                <dict/>
                <key>UserDefinedName</key>
                <string>{UserDefinedName:s}</string>
                <key>VPN</key>
                <dict>
                        <key>AuthenticationMethod</key>
                        <string>Password</string>
                        <!--
                            On demand can be toggled in the menu regardless of this setting.
                        -->
                        <key>OnDemandEnabled</key>
                        <integer>1</integer>
                        <key>OnDemandRules</key>
                        <array>

                          {not_on_ssids:s}


                          <!-- "Connect", "Disconnect", or "Ignore" if device is connected to a Cellular network -->
                          <dict>
                                  <key>Action</key>
                                  <string>Connect</string>
                                  <key>InterfaceTypeMatch</key>
                                  <string>Cellular</string>
                          </dict>

                          <!-- "Connect", "Disconnect", or "Ignore" if device is connected via Ethernet -->
                          <dict>
                                  <key>Action</key>
                                  <string>Connect</string>
                                  <key>InterfaceTypeMatch</key>
                                  <string>Ethernet</string>
                          </dict>

                          <!-- "Connect", "Disconnect", or "Ignore" if device is connected to any other WiFi network -->
                          <dict>
                                  <key>Action</key>
                                  <string>Connect</string>
                                  <key>InterfaceTypeMatch</key>
                                  <string>WiFi</string>
                          </dict>
                        </array>
                        <key>AuthName</key>
                        <string>DEFAULT</string>
                        <key>RemoteAddress</key>
                        <string>{host:s}</string>
                </dict>
                <key>VPNSubType</key>
                <string>net.openvpn.connect.app</string>
                <key>VPNType</key>
                <string>VPN</string>
                <key>VendorConfig</key>
                <dict>
                        <!--
                            These fields are passed as the openvpn configuration.
                            If a statement has no arguments the string NOARGS 
                            is used.
                        -->
                        <key>ca</key>
                            <string>{ca_crt:s}</string>
                        <key>cert</key>
                            <string>{client_crt:s}</string>
                        <key>key</key>
                            <string>{client_key:s}</string>
                        <key>client</key>
                            <string>NOARGS</string>
                        <key>comp-lzo</key>
                            <string>NOARGS</string>
                        <key>dev</key>
                            <string>tun</string>
                        <key>nobind</key>
                            <string>NOARGS</string>
                        <key>persist-key</key>
                            <string>NOARGS</string>
                        <key>persist-tun</key>
                            <string>NOARGS</string>
                        <key>port</key>
                            <string>{port:d}</string>
                        <key>proto</key>
                            <string>{proto:s}</string>
                        <key>remote</key>
                            <string>{host:s} {port:d}</string>
                        <key>resolv-retry</key>
                            <string>infinite</string>
                        <key>verb</key>
                            <string>6</string>
                        <key>redirect-gateway</key>
                            <string>NOARGS</string>
                        <key>cipher</key>
                            <string>AES-256-CBC</string>
                        <key>vpn-on-demand</key>
                            <string>0</string>
                </dict>
            </dict>
	</array>
	<key>PayloadDescription</key>
	<string>{ProfilePayloadDescription:s}</string>
	<key>PayloadDisplayName</key>
	<string>{ProfilePayloadDisplayName:s}</string>
	<key>PayloadIdentifier</key>
	<string>{PayloadIdentifier:s}</string>
	<key>PayloadOrganization</key>
	<string>{ProfilePayloadOrganization:s}</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>{config_payload_uuid:s}</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
